&НаСервере
Функция ПослеЗаписиНа(Объект)
	Если Объект.Проведен = Истина Тогда
	ТабличныйДокумент = Новый ТабличныйДокумент;
	Макет = Документы.ПротоколОсмотраПациентов.ПолучитьМакет("Макет");

	Шапка = Макет.ПолучитьОбласть("Шапка");
	ТабличныйДокумент.Вывести(Шапка);
	Информация = Макет.ПолучитьОбласть("Информация");

	Информация.Параметры.Пациент = Объект.Пациент;
	Информация.Параметры.Возраст = Объект.Возраст;
	Информация.Параметры.Номер = Объект.Номер;
	Информация.Параметры.Палата = Объект.Палата;
	Информация.Параметры.Дата = Объект.Дата;
	Информация.Параметры.Жалобы = Объект.Жалобы;
	Информация.Параметры.ОбщийСтатус = Объект.ОбщийСтатус;
	Информация.Параметры.ДиагнозОсновной = Объект.ДиагнозОсновной;
	Информация.Параметры.ДиагнозСопутствующий = Объект.ДиагнозСопутствующий;
	Информация.Параметры.НазначенияИРекомендации = Объект.НазначенияИРекомендации;

	ТабличныйДокумент.Вывести(Информация);
	Подвал = Макет.ПолучитьОбласть("Подвал");

	Подвал.Параметры.Врач = Объект.Врач;
	Подвал.Параметры.ЗавОРИТ = Объект.ЗавОРИТ;

	ТабличныйДокумент.Вывести(Подвал);

	Возврат ТабличныйДокумент;
	КонецЕсли;
КонецФункции

&НаСервере
Процедура ПриОткрытииНаСервере()
	Объект.Врач = ПараметрыСеанса.ТекущийПользователь.ФизическоеЛицо;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Документ = Объект;
	ТабличныйДокумент = ПослеЗаписиНа(Документ);
	ТабличныйДокумент.Показать();
КонецПроцедуры

&НаКлиенте
Процедура Подписать(Команда) 	
	ОбработчикПродолжения = Новый ОписаниеОповещения("ПослеДобавленияПодписей", ЭтотОбъект);
	
	ОписаниеДанных = Новый Структура;
	ОписаниеДанных.Вставить("Операция",            НСтр("ru = 'Подписание файла'"));
	ОписаниеДанных.Вставить("ЗаголовокДанных",     НСтр("ru = 'Файл'"));
	ОписаниеДанных.Вставить("ПоказатьКомментарий", Истина);
	
	ИмяФайла_ = ПолучитьИмяВременногоФайла();
	Документ_ = Новый ТекстовыйДокумент;
	Документ_.УстановитьТекст(Неопределено);
	Документ_.Записать(ИмяФайла_, , Символы.ПС);
	ДокументДанные_ = Новый ДвоичныеДанные(ИмяФайла_);
	
	ОписаниеДанных.Вставить("Данные", ДокументДанные_);
	ОписаниеДанных.Вставить("Объект", Объект.Ссылка);
	
	МодульЭлектроннаяПодписьКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ЭлектроннаяПодписьКлиент");
	МодульЭлектроннаяПодписьКлиент.Подписать(ОписаниеДанных, , ОбработчикПродолжения);
КонецПроцедуры

&НаКлиенте
Процедура ПослеДобавленияПодписей(ПараметрыВыполнения, Контекст) Экспорт	
	ОбновитьИнформациюОПодписиОбъекта();	
КонецПроцедуры

&НаСервере
Процедура ОбновитьИнформациюОПодписиОбъекта()
	ФайлОбъект = ЭтотОбъект.Объект.Ссылка.ПолучитьОбъект();
	ЗначениеВРеквизитФормы(ФайлОбъект, "Объект");
	РаботаСФайламиСлужебный.ЗаполнитьСписокПодписей(ЭтотОбъект);	
КонецПроцедуры