
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Виселица = БиблиотекаКартинок.Старт;
  	Стадия = 0;
КонецПроцедуры

&НаСервере
Процедура НачатьИгруНаСервере()
	Запрос = Новый Запрос;
  	Запрос.Текст = 
  	"ВЫБРАТЬ
  	|		Слова.Ссылка КАК Слово
  	|		ИЗ
  	|  	Справочник.СловаВиселицы КАК Слова";
  	Результат = Запрос.Выполнить().Выгрузить();
  	КоличествоСлов = Результат.Количество();
  
  	ГСЧ = Новый ГенераторСлучайныхЧисел();
  	СлучайноеЧисло = ГСЧ.СлучайноеЧисло(1, КоличествоСлов);
  	ЗагаданноеСлово = ВРег(Результат[СлучайноеЧисло -1].Слово);
  	С = "";
 	ДлинаСлова = СтрДлина(ЗагаданноеСлово);
  	Для Индекс = 1 По ДлинаСлова Цикл
    	Если Индекс > 1 И Индекс < ДлинаСлова Тогда
      		С = С + " _ ";
    	Иначе
      		С = С + Сред(ЗагаданноеСлово, Индекс, 1);
    	КонецЕсли;
  	КонецЦикла;   
  	Слово = С;
КонецПроцедуры

&НаКлиенте
Процедура НачатьИгру(Команда) 
	Виселица = БиблиотекаКартинок.С0;
  	Стадия = 0;
  	Буква = "";
	НачатьИгруНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПроверитьНаСервере()
	С = "";
  	ДлинаСлова = СтрДлина(ЗагаданноеСлово);
  	Б = ВРег(Буква);
  	БукваУгадана = Ложь; 
  
  	Для инд = 1 По ДлинаСлова Цикл
    	А = Сред(ЗагаданноеСлово, инд, 1);
    	Если инд > 1 И инд < ДлинаСлова Тогда
      		Если А = Б Тогда
        		С = С + Б;
        		БукваУгадана = Истина;
      		ИначеЕсли СтрНайти(Слово, А) > 0 Тогда
        		С = С + А;
      		Иначе
        		С = С + " _ ";
      		КонецЕсли;
    	Иначе
      		С = С + Сред(ЗагаданноеСлово, инд, 1);
    	КонецЕсли;
  	КонецЦикла;
    
  	Слово = С;
   	Если Слово = ЗагаданноеСлово Тогда
    	Сообщить("Вы выиграли!");
    	Виселица = БиблиотекаКартинок.Старт;
  	ИначеЕсли Не БукваУгадана Тогда
    	Стадия = Стадия + 1;
    	Если Стадия = 6 Тогда
      		Сообщить("Вы проиграли...");
    	КонецЕсли;
    	Виселица = БиблиотекаКартинок["С" + Стадия];
  	КонецЕсли;
  	 ЭтаФорма.ТекущийЭлемент = Элементы.Буква;
КонецПроцедуры

&НаКлиенте
Процедура Проверить(Команда) 
	Если Стадия = 6 Тогда
    	Сообщение = Новый СообщениеПользователю;
    	Сообщение.Текст = "Вы проиграли";
    	Сообщение.Сообщить();
    	Возврат;
  	КонецЕсли;
	ПроверитьНаСервере();
КонецПроцедуры
